"""
Принципы Объектно-Ориентированного Программирования в Python:

Данные структурируются в виде объектов, каждый из которых имеет определенный тип,
то есть принадлежит к какому-либо классу.

Классы – результат формализации решаемой задачи, выделения главных ее аспектов.

Внутри объекта инкапсулируется логика работы с относящейся к нему информацией.

Объекты в программе взаимодействуют друг с другом, обмениваются запросами и ответами.

При этом объекты одного типа сходным образом отвечают на одни и те же запросы.

Объекты могут организовываться в более сложные структуры, например, включать другие объекты или наследовать
от одного или нескольких объектов.
"""

print(__doc__)
